pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_vpr.h
/*
 * Copyright (c) 2023 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_VPR_H__
#define NRF_VPR_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_vpr_hal VPR HAL
 * @{
 * @ingroup nrf_vpr
 * @brief   Hardware access layer for managing the VPR RISC-V CPU unit (VPR).
 */

/** @brief Symbol specifying maximum number of available events triggered. */
#define NRF_VPR_EVENTS_TRIGGERED_COUNT VPR_EVENTS_TRIGGERED_MaxCount

/** @brief Macro for creating the interrupt bitmask for all event channels */
#define NRF_VPR_ALL_CHANNELS_INT_MASK \
    ((uint32_t) (((1ULL << NRF_VPR_EVENTS_TRIGGERED_COUNT) - 1) \
     << VPR_EVENTS_TRIGGERED_MinIndex))

/** @brief Macro used as an mask to clear all triggered interrupts within CSR */
#define NRF_VPR_TASK_TRIGGER_ALL_MASK UINT32_MAX

/** @brief Symbol specifying minimal index of TRIGGERED events array that is implemented. */
#define NRF_VPR_EVENTS_TRIGGERED_MIN VPR_EVENTS_TRIGGERED_MinIndex

/** @brief Symbol specifying maximal index of TRIGGERED events array that is implemented. */
#define NRF_VPR_EVENTS_TRIGGERED_MAX VPR_EVENTS_TRIGGERED_MaxIndex

/** @brief Symbol specifying minimal index of TRIGGER tasks array that is implemented. */
#define NRF_VPR_TASKS_TRIGGER_MIN VPR_TASKS_TRIGGER_MinIndex

/** @brief Symbol specifying maximal index of TRIGGER tasks array that is implemented. */
#define NRF_VPR_TASKS_TRIGGER_MAX VPR_TASKS_TRIGGER_MaxIndex

/** @brief VPR events. */
typedef enum
{
#if NRF_VPR_EVENTS_TRIGGERED_MIN < 16
    NRF_VPR_EVENT_TRIGGERED_0  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[0]),
    NRF_VPR_EVENT_TRIGGERED_1  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[1]),
    NRF_VPR_EVENT_TRIGGERED_2  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[2]),
    NRF_VPR_EVENT_TRIGGERED_3  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[3]),
    NRF_VPR_EVENT_TRIGGERED_4  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[4]),
    NRF_VPR_EVENT_TRIGGERED_5  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[5]),
    NRF_VPR_EVENT_TRIGGERED_6  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[6]),
    NRF_VPR_EVENT_TRIGGERED_7  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[7]),
    NRF_VPR_EVENT_TRIGGERED_8  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[8]),
    NRF_VPR_EVENT_TRIGGERED_9  = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[9]),
    NRF_VPR_EVENT_TRIGGERED_10 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[10]),
    NRF_VPR_EVENT_TRIGGERED_11 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[11]),
    NRF_VPR_EVENT_TRIGGERED_12 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[12]),
    NRF_VPR_EVENT_TRIGGERED_13 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[13]),
    NRF_VPR_EVENT_TRIGGERED_14 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[14]),
    NRF_VPR_EVENT_TRIGGERED_15 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[15]),
#endif
    NRF_VPR_EVENT_TRIGGERED_16 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[16]),
    NRF_VPR_EVENT_TRIGGERED_17 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[17]),
    NRF_VPR_EVENT_TRIGGERED_18 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[18]),
    NRF_VPR_EVENT_TRIGGERED_19 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[19]),
    NRF_VPR_EVENT_TRIGGERED_20 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[20]),
    NRF_VPR_EVENT_TRIGGERED_21 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[21]),
    NRF_VPR_EVENT_TRIGGERED_22 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[22]),
#if NRF_VPR_EVENTS_TRIGGERED_MAX > 22
    NRF_VPR_EVENT_TRIGGERED_23 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[23]),
    NRF_VPR_EVENT_TRIGGERED_24 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[24]),
    NRF_VPR_EVENT_TRIGGERED_25 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[25]),
    NRF_VPR_EVENT_TRIGGERED_26 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[26]),
    NRF_VPR_EVENT_TRIGGERED_27 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[27]),
    NRF_VPR_EVENT_TRIGGERED_28 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[28]),
    NRF_VPR_EVENT_TRIGGERED_29 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[29]),
    NRF_VPR_EVENT_TRIGGERED_30 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[30]),
    NRF_VPR_EVENT_TRIGGERED_31 = offsetof(NRF_VPR_Type, EVENTS_TRIGGERED[31]),
#endif
} nrf_vpr_event_t;

/** @brief VPR interrupts. */
typedef enum
{
#if NRF_VPR_EVENTS_TRIGGERED_MIN < 16
    NRF_VPR_INT_TRIGGERED_0_MASK  = VPR_INTENSET_TRIGGERED0_Msk,
    NRF_VPR_INT_TRIGGERED_1_MASK  = VPR_INTENSET_TRIGGERED1_Msk,
    NRF_VPR_INT_TRIGGERED_2_MASK  = VPR_INTENSET_TRIGGERED2_Msk,
    NRF_VPR_INT_TRIGGERED_3_MASK  = VPR_INTENSET_TRIGGERED3_Msk,
    NRF_VPR_INT_TRIGGERED_4_MASK  = VPR_INTENSET_TRIGGERED4_Msk,
    NRF_VPR_INT_TRIGGERED_5_MASK  = VPR_INTENSET_TRIGGERED5_Msk,
    NRF_VPR_INT_TRIGGERED_6_MASK  = VPR_INTENSET_TRIGGERED6_Msk,
    NRF_VPR_INT_TRIGGERED_7_MASK  = VPR_INTENSET_TRIGGERED7_Msk,
    NRF_VPR_INT_TRIGGERED_8_MASK  = VPR_INTENSET_TRIGGERED8_Msk,
    NRF_VPR_INT_TRIGGERED_9_MASK  = VPR_INTENSET_TRIGGERED9_Msk,
    NRF_VPR_INT_TRIGGERED_10_MASK = VPR_INTENSET_TRIGGERED10_Msk,
    NRF_VPR_INT_TRIGGERED_11_MASK = VPR_INTENSET_TRIGGERED11_Msk,
    NRF_VPR_INT_TRIGGERED_12_MASK = VPR_INTENSET_TRIGGERED12_Msk,
    NRF_VPR_INT_TRIGGERED_13_MASK = VPR_INTENSET_TRIGGERED13_Msk,
    NRF_VPR_INT_TRIGGERED_14_MASK = VPR_INTENSET_TRIGGERED14_Msk,
    NRF_VPR_INT_TRIGGERED_15_MASK = VPR_INTENSET_TRIGGERED15_Msk,
#endif
    NRF_VPR_INT_TRIGGERED_16_MASK = VPR_INTENSET_TRIGGERED16_Msk,
    NRF_VPR_INT_TRIGGERED_17_MASK = VPR_INTENSET_TRIGGERED17_Msk,
    NRF_VPR_INT_TRIGGERED_18_MASK = VPR_INTENSET_TRIGGERED18_Msk,
    NRF_VPR_INT_TRIGGERED_19_MASK = VPR_INTENSET_TRIGGERED19_Msk,
    NRF_VPR_INT_TRIGGERED_20_MASK = VPR_INTENSET_TRIGGERED20_Msk,
    NRF_VPR_INT_TRIGGERED_21_MASK = VPR_INTENSET_TRIGGERED21_Msk,
    NRF_VPR_INT_TRIGGERED_22_MASK = VPR_INTENSET_TRIGGERED22_Msk,
#if NRF_VPR_EVENTS_TRIGGERED_MAX > 22
    NRF_VPR_INT_TRIGGERED_23_MASK = VPR_INTENSET_TRIGGERED23_Msk,
    NRF_VPR_INT_TRIGGERED_24_MASK = VPR_INTENSET_TRIGGERED24_Msk,
    NRF_VPR_INT_TRIGGERED_25_MASK = VPR_INTENSET_TRIGGERED25_Msk,
    NRF_VPR_INT_TRIGGERED_26_MASK = VPR_INTENSET_TRIGGERED26_Msk,
    NRF_VPR_INT_TRIGGERED_27_MASK = VPR_INTENSET_TRIGGERED27_Msk,
    NRF_VPR_INT_TRIGGERED_28_MASK = VPR_INTENSET_TRIGGERED28_Msk,
    NRF_VPR_INT_TRIGGERED_29_MASK = VPR_INTENSET_TRIGGERED29_Msk,
    NRF_VPR_INT_TRIGGERED_30_MASK = VPR_INTENSET_TRIGGERED30_Msk,
    NRF_VPR_INT_TRIGGERED_31_MASK = VPR_INTENSET_TRIGGERED31_Msk,
#endif
} nrf_vpr_int_mask_t;

/** @brief VPR tasks. */
typedef enum
{
#if NRF_VPR_TASKS_TRIGGER_MIN < 16
    NRF_VPR_TASK_TRIGGER_0  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[0]),
    NRF_VPR_TASK_TRIGGER_1  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[1]),
    NRF_VPR_TASK_TRIGGER_2  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[2]),
    NRF_VPR_TASK_TRIGGER_3  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[3]),
    NRF_VPR_TASK_TRIGGER_4  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[4]),
    NRF_VPR_TASK_TRIGGER_5  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[5]),
    NRF_VPR_TASK_TRIGGER_6  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[6]),
    NRF_VPR_TASK_TRIGGER_7  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[7]),
    NRF_VPR_TASK_TRIGGER_8  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[8]),
    NRF_VPR_TASK_TRIGGER_9  = offsetof(NRF_VPR_Type, TASKS_TRIGGER[9]),
    NRF_VPR_TASK_TRIGGER_10 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[10]),
    NRF_VPR_TASK_TRIGGER_11 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[11]),
    NRF_VPR_TASK_TRIGGER_12 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[12]),
    NRF_VPR_TASK_TRIGGER_13 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[13]),
    NRF_VPR_TASK_TRIGGER_14 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[14]),
    NRF_VPR_TASK_TRIGGER_15 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[15]),
#endif
    NRF_VPR_TASK_TRIGGER_16 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[16]),
    NRF_VPR_TASK_TRIGGER_17 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[17]),
    NRF_VPR_TASK_TRIGGER_18 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[18]),
    NRF_VPR_TASK_TRIGGER_19 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[19]),
    NRF_VPR_TASK_TRIGGER_20 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[20]),
    NRF_VPR_TASK_TRIGGER_21 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[21]),
    NRF_VPR_TASK_TRIGGER_22 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[22]),
#if NRF_VPR_TASKS_TRIGGER_MAX > 22
    NRF_VPR_TASK_TRIGGER_23 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[23]),
    NRF_VPR_TASK_TRIGGER_24 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[24]),
    NRF_VPR_TASK_TRIGGER_25 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[25]),
    NRF_VPR_TASK_TRIGGER_26 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[26]),
    NRF_VPR_TASK_TRIGGER_27 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[27]),
    NRF_VPR_TASK_TRIGGER_28 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[28]),
    NRF_VPR_TASK_TRIGGER_29 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[29]),
    NRF_VPR_TASK_TRIGGER_30 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[30]),
    NRF_VPR_TASK_TRIGGER_31 = offsetof(NRF_VPR_Type, TASKS_TRIGGER[31]),
#endif
} nrf_vpr_task_t;

/** @brief Debug Mode Control signals. */
typedef enum
{
    NRF_VPR_DMCONTROL_DMACTIVE,
    NRF_VPR_DMCONTROL_NDMRESET,
} nrf_vpr_dmcontrol_t;

/** @brief Debug Mode Control signal masks. */
typedef enum
{
    NRF_VPR_DMCONTROL_DMACTIVE_MASK = VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk,
    NRF_VPR_DMCONTROL_NDMRESET_MASK = VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk,
} nrf_vpr_dmcontrol_mask_t;

/**
 * @brief Function for triggering the specified VPR task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task to be triggered.
 */
NRF_STATIC_INLINE void nrf_vpr_task_trigger(NRF_VPR_Type * p_reg, nrf_vpr_task_t task);

/**
 * @brief Function for getting the address of the specified VPR task register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Specified task.
 *
 * @return Address of the specified task register.
 */
NRF_STATIC_INLINE uint32_t nrf_vpr_task_address_get(NRF_VPR_Type const * p_reg,
                                                    nrf_vpr_task_t       task);

/**
 * @brief Function for getting the specified VPR TRIGGER task.
 *
 * @param[in] index Task index.
 *
 * @return The specified VPR TRIGGER task.
 */
NRF_STATIC_INLINE nrf_vpr_task_t nrf_vpr_trigger_task_get(uint8_t index);

/**
 * @brief Function for clearing the specified VPR event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to clear.
 */
NRF_STATIC_INLINE void nrf_vpr_event_clear(NRF_VPR_Type * p_reg, nrf_vpr_event_t event);

/**
 * @brief Function for retrieving the state of the VPR event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_vpr_event_check(NRF_VPR_Type const * p_reg, nrf_vpr_event_t event);

/**
 * @brief Function for getting the address of the specified VPR event register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Specified event.
 *
 * @return Address of the specified event register.
 */
NRF_STATIC_INLINE uint32_t nrf_vpr_event_address_get(NRF_VPR_Type const * p_reg,
                                                     nrf_vpr_event_t      event);

/**
 * @brief Function for getting the specified VPR TRIGGERED event.
 *
 * @param[in] index Event index.
 *
 * @return The specified VPR TRIGGERED event.
 */
NRF_STATIC_INLINE nrf_vpr_event_t nrf_vpr_triggered_event_get(uint8_t index);

/**
 * @brief Function for enabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be enabled.
 *                  Use @ref nrf_vpr_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_vpr_int_enable(NRF_VPR_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be disabled.
 *                  Use @ref nrf_vpr_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_vpr_int_disable(NRF_VPR_Type * p_reg, uint32_t mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be checked.
 *                  Use @ref nrf_vpr_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_vpr_int_enable_check(NRF_VPR_Type const * p_reg,
                                                    uint32_t             mask);

/**
 * @brief Function for setting the state of the CPU after core reset.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if CPU is to be running, false if stopped.
 */
NRF_STATIC_INLINE void nrf_vpr_cpurun_set(NRF_VPR_Type * p_reg,
                                          bool           enable);

/**
 * @brief Function for getting the state of the CPU after core reset.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  CPU is to be running after core reset.
 * @retval false CPU is to be stopped after core reset.
 */
NRF_STATIC_INLINE bool nrf_vpr_cpurun_get(NRF_VPR_Type const * p_reg);

/**
 * @brief Function for setting the initial value of the program counter after CPU reset.
 *
 * @note This address value must be 64-bit aligned.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] pc    Initial value of the program counter to be set.
 */
NRF_STATIC_INLINE void nrf_vpr_initpc_set(NRF_VPR_Type * p_reg,
                                          uint32_t       pc);

/**
 * @brief Function for getting the initial value of the program counter after CPU reset.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Initial value of the program counter.
 */
NRF_STATIC_INLINE uint32_t nrf_vpr_initpc_get(NRF_VPR_Type const * p_reg);

/**
 * @brief Function for setting the specified debug mode control signal.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] signal Signal to be set.
 * @param[in] enable True if signal is to be 1, false if 0.
 */
NRF_STATIC_INLINE void nrf_vpr_debugif_dmcontrol_set(NRF_VPR_Type *      p_reg,
                                                     nrf_vpr_dmcontrol_t signal,
                                                     bool                enable);

/**
 * @brief Function for setting the mask of debug mode control signals.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of signals to be set.
 *                  Use @ref nrf_vpr_dmcontrol_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_vpr_debugif_dmcontrol_mask_set(NRF_VPR_Type * p_reg,
                                                          uint32_t       mask);

/**
 * @brief Function for getting the debug mode control signals.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] signal Signal to be retrieved.
 *
 * @retval true  Signal is logical 1.
 * @retval false Signal is logical 0.
 */
NRF_STATIC_INLINE bool nrf_vpr_debugif_dmcontrol_get(NRF_VPR_Type const * p_reg,
                                                     nrf_vpr_dmcontrol_t  signal);

#ifndef NRF_DECLARE_ONLY
NRF_STATIC_INLINE void nrf_vpr_task_trigger(NRF_VPR_Type * p_reg, nrf_vpr_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

NRF_STATIC_INLINE uint32_t nrf_vpr_task_address_get(NRF_VPR_Type const * p_reg,
                                                    nrf_vpr_task_t       task)
{
    return nrf_task_event_address_get(p_reg, task);
}

NRF_STATIC_INLINE nrf_vpr_task_t nrf_vpr_trigger_task_get(uint8_t index)
{
    return (nrf_vpr_task_t)NRFX_OFFSETOF(NRF_VPR_Type, TASKS_TRIGGER[index]);
}

NRF_STATIC_INLINE void nrf_vpr_event_clear(NRF_VPR_Type * p_reg, nrf_vpr_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
}

NRF_STATIC_INLINE bool nrf_vpr_event_check(NRF_VPR_Type const * p_reg, nrf_vpr_event_t event)
{
    return nrf_event_check(p_reg, event);
}

NRF_STATIC_INLINE uint32_t nrf_vpr_event_address_get(NRF_VPR_Type const * p_reg,
                                                     nrf_vpr_event_t      event)
{
    return nrf_task_event_address_get(p_reg, event);
}

NRF_STATIC_INLINE nrf_vpr_event_t nrf_vpr_triggered_event_get(uint8_t index)
{
    return (nrf_vpr_event_t)NRFX_OFFSETOF(NRF_VPR_Type, EVENTS_TRIGGERED[index]);
}

NRF_STATIC_INLINE void nrf_vpr_int_enable(NRF_VPR_Type * p_reg, uint32_t mask)
{
    p_reg->INTENSET = mask;
}

NRF_STATIC_INLINE void nrf_vpr_int_disable(NRF_VPR_Type * p_reg, uint32_t mask)
{
    p_reg->INTENCLR = mask;
}

NRF_STATIC_INLINE uint32_t nrf_vpr_int_enable_check(NRF_VPR_Type const * p_reg,
                                                    uint32_t             mask)
{
    return p_reg->INTENSET & mask;
}

NRF_STATIC_INLINE void nrf_vpr_cpurun_set(NRF_VPR_Type * p_reg,
                                          bool           enable)
{
    p_reg->CPURUN = (enable ? VPR_CPURUN_EN_Running : VPR_CPURUN_EN_Stopped) << VPR_CPURUN_EN_Pos;
}

NRF_STATIC_INLINE bool nrf_vpr_cpurun_get(NRF_VPR_Type const * p_reg)
{
    return (p_reg->CPURUN & VPR_CPURUN_EN_Msk) >> VPR_CPURUN_EN_Pos;
}

NRF_STATIC_INLINE void nrf_vpr_initpc_set(NRF_VPR_Type * p_reg,
                                          uint32_t       pc)
{
    NRFX_ASSERT((pc & 0x7FUL) == 0);
    p_reg->INITPC = pc;
}

NRF_STATIC_INLINE uint32_t nrf_vpr_initpc_get(NRF_VPR_Type const * p_reg)
{
    return p_reg->INITPC;
}

NRF_STATIC_INLINE void nrf_vpr_debugif_dmcontrol_set(NRF_VPR_Type *      p_reg,
                                                     nrf_vpr_dmcontrol_t signal,
                                                     bool                enable)
{
    switch (signal)
    {
        case NRF_VPR_DMCONTROL_DMACTIVE:
            p_reg->DEBUGIF.DMCONTROL = ((p_reg->DEBUGIF.DMCONTROL &
                                         ~VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk) |
                                        ((enable ? VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled :
                                          VPR_DEBUGIF_DMCONTROL_DMACTIVE_Disabled)
                                         << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos));
            break;
        case NRF_VPR_DMCONTROL_NDMRESET:
            p_reg->DEBUGIF.DMCONTROL = ((p_reg->DEBUGIF.DMCONTROL &
                                         ~VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk) |
                                        ((enable ? VPR_DEBUGIF_DMCONTROL_NDMRESET_Active :
                                          VPR_DEBUGIF_DMCONTROL_NDMRESET_Inactive)
                                         << VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos));
            break;
        default:
            NRFX_ASSERT(0);
    }
}

NRF_STATIC_INLINE void nrf_vpr_debugif_dmcontrol_mask_set(NRF_VPR_Type * p_reg,
                                                          uint32_t       mask)
{
    p_reg->DEBUGIF.DMCONTROL = mask;
}

NRF_STATIC_INLINE bool nrf_vpr_debugif_dmcontrol_get(NRF_VPR_Type const * p_reg,
                                                     nrf_vpr_dmcontrol_t  signal)
{
    switch (signal)
    {
        case NRF_VPR_DMCONTROL_DMACTIVE:
            return ((p_reg->DEBUGIF.DMCONTROL & VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk)
                    >> VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos);
        case NRF_VPR_DMCONTROL_NDMRESET:
            return ((p_reg->DEBUGIF.DMCONTROL & VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk)
                    >> VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos);
        default:
            NRFX_ASSERT(0);
            return false;
    }
}

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_VPR_H__
